# Пользователь вводит предложение, заменить все пробелы на '-' 2-мя способами.
text = input()
print(text, sep="-")
